Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Creating the application is straightforward using the Quarkus Maven plugin. Note that Quarkus 3.x requires Java 17 or higher (we used Java 21 for this example):
ja_jp: アプリケーションの作成は、Quarkus Maven プラグインを使用して簡単に行えます。Quarkus 3.x には Java 17 以上が必要であることに注意してください (この例では Java 21 を使用しました)。

source: Creating the archive
ja_jp: アーカイブの作成

source: Creating the bare classes
ja_jp: ベアクラスの作成

source: Creating the bare entities
ja_jp: ただのエンティティの作成

source: Creating the distribution
ja_jp: ディストリビューションの作成

source: Creating the endpoints
ja_jp: エンドポイントの作成

source: Creating the extension
ja_jp: エクステンションの作成

source: Creating the extension is as simple as:
ja_jp: エクステンションの作成は以下のようにとても簡単です。

source: Creating the first JSON REST service
ja_jp: 初めての JSON REST サービスの作成

source: Creating the functions
ja_jp: 関数の作成

source: Creating the initial file
ja_jp: 初期ファイルの作成

source: Creating the project
ja_jp: プロジェクトの作成

source: Creating the resource and the test
ja_jp: リソースとテストの作成

source: Creating the server
ja_jp: サーバーの作成

source: Creating the test class
ja_jp: テストクラスの作成

source: Creating your first JSON REST service
ja_jp: 初めてのJSON RESTサービスの作成

source: Creating your first health check
ja_jp: 初めてのヘルスチェックの作成

source: Credential profiles file at the default location (`~/.aws/credentials`) shared by all AWS SDKs and the AWS CLI
ja_jp: すべての AWS SDK および AWS CLI で共有される、デフォルトの場所( `~/.aws/credentials` )にある資格情報プロファイルのファイル

source: Credential providers
ja_jp: 認証情報プロバイダー

source: Credentials Provider
ja_jp: 資格情報プロバイダー

source: Credentials are sent as plain text
ja_jp: 認証情報がプレーンテキストで送信されます

source: Credentials are sent with each request
ja_jp: 認証情報はリクエスト毎に送信されます

source: Credentials can be externalized using environment variables. Credentials can also be externalized using any other supported Quarkus configuration source.
ja_jp: クレデンシャルは環境変数を使用して外部化できます。クレデンシャルは、他のサポートされている Quarkus 設定ソースを使用しても外部化できます。

source: Credentials delivered through the Amazon ECS if the `AWS_CONTAINER_CREDENTIALS_RELATIVE_URI` environment variable is set and the security manager has permission to access the variable,
ja_jp: `AWS_CONTAINER_CREDENTIALS_RELATIVE_URI` 環境変数が設定されていて、セキュリティーマネージャーがその変数にアクセスする権限を持っている場合に、Amazon ECS を通して配信されるクレデンシャル

source: CronJob resources require the https://en.wikipedia.org/wiki/Cron[Cron] expression to specify when to launch the job through the `quarkus.openshift.cron-job.schedule` property. If they are not provided, the build fails.
ja_jp: CronJobリソースは、 `quarkus.openshift.cron-job.schedule` プロパティを通して、いつジョブを起動するかを指定する link:https://en.wikipedia.org/wiki/Cron[Cron] 式を必要とします。 それらが提供されない場合、ビルドは失敗します。

source: CronJob resources require the https://en.wikipedia.org/wiki/Cron[Cron] expression to specify when to launch the job via the property `quarkus.kubernetes.cron-job.schedule`. If not provide, the build will fail.
ja_jp: CronJob リソースは、 link:https://en.wikipedia.org/wiki/Cron[Cron] 式がプロパティー `quarkus.openshift.cron-job.schedule` を介してジョブを起動するタイミングを指定することを必要とします。提供されない場合、ビルドは失敗します。

source: CronJob resources require the https://en.wikipedia.org/wiki/Cron[Cron] expression to specify when to launch the job via the property `quarkus.openshift.cron-job.schedule`. If not provide, the build will fail.
ja_jp: CronJob リソースは、プロパティ `quarkus.openshift.cron-job.schedule` で link:https://en.wikipedia.org/wiki/Cron[Cron] 式でジョブを起動するタイミングを指定することを必要とします。指定されない場合、ビルドは失敗します。

source: Cross Origin Resource Sharing
ja_jp: クロスオリジンリソース共有

source: Cross Site Request Forgery (CSRF) prevention
ja_jp: クロスサイトリクエストフォージェリ（CSRF）対策

source: Cross Site Request Forgery (CSRF) prevention filter
ja_jp: クロスサイトリクエストフォージェリー（CSRF）防止フィルター

source: Cross Site Request Forgery (CSRF) prevention filter for RESTEasy Reactive (well, security is not always exciting but being well prepared prevents some unnecessary stressful times)
ja_jp: RESTEasy Reactiveのクロスサイトリクエストフォージェリー（CSRF）防止フィルター（セキュリティは常にエキサイティングなものではありませんが、しっかりとした備えがあれば、不必要なストレスを感じることはありません。）

source: Cross-Origin Resource Sharing
ja_jp: クロスオリジンリソース共有

source: Cross-Origin Resource Sharing (CORS)
ja_jp: クロスオリジンリソース共有（CORS）

source: Cross-Origin Resource Sharing (CORS) uses HTTP headers to manage browser requests for resources from external origins securely. By specifying permitted origins, methods, and headers, Quarkus servers can use the CORS filter to enable browsers to request resources across domains while maintaining controlled access. This mechanism enhances security and supports legitimate cross-origin requests. For more on origin definitions, see the link:https://datatracker.ietf.org/doc/html/rfc6454[Web Origin Concept].
ja_jp: Cross-Origin Resource Sharing (CORS) は、HTTP ヘッダーを使用して、外部オリジンからのリソースに対するブラウザーリクエストを安全に管理します。 許可されたオリジン、メソッド、ヘッダーを指定して、Quarkus サーバーは CORS フィルターを使用して、制御されたアクセスを維持しながらブラウザーがドメイン間でリソースを要求できるようします。 このメカニズムにより、セキュリティーが強化され、正当なクロスオリジンリクエストがサポートされます。 オリジン定義の詳細は、 link:https://datatracker.ietf.org/doc/html/rfc6454[Web Origin Concept] を参照してください。

source: Cross-Site Request Forgery (CSRF) is an attack that forces an end user to execute unwanted actions on a web application in which they are currently authenticated.
ja_jp: クロスサイトリクエストフォージェリ（CSRF）は、エンドユーザーが現在認証されているウェブアプリケーション上で望まない動作を実行させる攻撃です。

source: Cross-Site Request Forgery (CSRF) prevention
ja_jp: クロスサイト・リクエスト・フォージェリ（CSRF）対策

source: Cross-Site Request Forgery Prevention
ja_jp: クロスサイトリクエストフォージェリー対策

source: Cross-cutting concerns
ja_jp: 複数の部分に共通する機能や関心事

source: Cross-document anchored ID call example
ja_jp: ドキュメント間のアンカー ID 呼び出しの例

source: Cross-origin resource sharing
ja_jp: クロスオリジンリソース共有

source: Cross-origin resource sharing (CORS) is an HTTP-header-based mechanism that allows a server to indicate any origins other than its own, from which a browser should permit loading resources.
ja_jp: クロスオリジンリソース共有 (CORS) は、HTTPヘッダーベースのメカニズムで、ブラウザがリソースの読み込みを許可すべきオリジンを、サーバーが自分以外のオリジンに示すことを可能にします。

source: Cross-reference example
ja_jp: クロスリファレンス例

source: Cross-reference phrasing
ja_jp: クロスリファレンスのフレーズ

source: Cross-reference source attributes
ja_jp: クロスリファレンスソース属性

source: Cross-references
ja_jp: クロスリファレンス

source: Cross-site Request Forgery (CSRF) prevention
ja_jp: Cross-site Request Forgery (CSRF) 対策

source: Cross-site replication is a powerful feature offered by Infinispan that facilitates data backup between clusters situated in geographically diverse data centers, even spanning across various cloud providers. Learn more in the link:https://infinispan.org/docs/stable/titles/xsite/xsite.html[Infinispan documentation].
ja_jp: クロスサイトレプリケーションはInfinispanが提供する強力な機能で、さまざまなクラウドプロバイダに跨った地理的に異なるデータセンターにあるクラスタ間のデータバックアップを容易にします。詳細は link:https://infinispan.org/docs/stable/titles/xsite/xsite.html[Infinispanのドキュメント] をご覧ください。

source: Crucially, the team recognized that a successful TLP required a future-proof technical core, which led to one of its most pivotal architectural decisions: adopting Quarkus.
ja_jp: 極めて重要なことに、チームは成功する TLP には将来性のある技術コアが必要であることを認識し、その最も重要なアーキテクチャ上の決定の 1 つである Quarkus の採用につながりました。

source: Cryostat Automated Analysis Report
ja_jp: クライオスタット自動分析レポート

source: Cryostat Communication
ja_jp: Cryostat通信

source: Cryostat Creation
ja_jp: Cryostat作成

source: Cryostat Discovery
ja_jp: Cryostatディスカバリー

source: Cryostat Installation
ja_jp: Cryostatインストール

source: Cryostat can discover target applications automatically and use their discovered Remote JMX service URLs to connect. Automatic discovery depends on the deployment platform - at the time of writing, Cryostat will use the OpenShift/Kubernetes API to discover `+Endpoints+` objects when deployed on OpenShift/Kubernetes. If no OpenShift/Kubernetes API server is available then Cryostat falls back to using the Java Discovery Protocol (JDP). In any case the automatically discovered targets are merged with the custom targets. If OpenShift/Kubernetes `+Endpoints+` discovery is used then the target application should have an associated `+Service+` object that exposes a port for cluster-internal JMX traffic. This port must either use the port number 9091 or have the name `+jfr-jmx+` for Cryostat to pick it up as an intended target application.
ja_jp: Cryostat はターゲットアプリケーションを自動的に検出し、検出されたリモート JMX サービス URL を使用して接続することができます。自動検出はデプロイメントプラットフォームに依存します。執筆時点では、OpenShift/Kubernetes にデプロイされた場合、Cryostat は `Endpoints` オブジェクトを検出するために OpenShift/Kubernetes API を使用します。OpenShift/Kubernetes APIサーバがない場合、CryostatはJava Discovery Protocol (JDP)を使用するようにフォールバックします。いずれの場合も、自動的に検出されたターゲットは、カスタムターゲットにマージされます。OpenShift/Kubernetes `Endpoints` ディスカバリーが使用される場合、ターゲットアプリケーションは、クラスタ内部のJMXトラフィック用のポートを公開する関連する `Service` オブジェクトを持つ必要があります。このポートは、Cryostat が意図したターゲットアプリケーションとしてピックアップするために、ポート番号 9091 を使用するか、 `jfr-jmx` という名前を持っている必要があります。

source: Cryostat uses JMX to talk to applications running on the HotSpot JVM, including but not limited to Java and Scala applications. JMX is a standard Java technology that allows tools to connect to applications and perform actions or retrieve data across a variety of underlying transport protocols. If you build and deploy your Quarkus application in JVM mode then JMX support is already built-in and ready out of the box. There are two ways to enable JMX on your application.
ja_jp: CryostatはJMXを使用して、HotSpot JVM上で動作するアプリケーション（JavaおよびScalaアプリケーションを含むが、これに限定されない）と対話します。JMXは、ツールがアプリケーションに接続してアクションを実行したり、さまざまな基礎となるトランスポートプロトコルを介してデータを取得したりできるようにする標準のJavaテクノロジーです。QuarkusアプリケーションをJVMモードで構築してデプロイする場合、JMXサポートはすでに組み込まれており、すぐに使用できます。アプリケーションでJMXを有効にするには、2つの方法があります。

source: Curated online stories, articles, and videos about Quarkus are available in the February 2026 edition of the Quarkus Newsletter.
ja_jp: Quarkusに関する厳選されたオンライン記事、記事、動画が、2026年2月号のQuarkusニュースレターでご覧いただけます。

source: Curated online stories, articles, and videos about Quarkus are available in the January 2026 edition of the Quarkus Newsletter.
ja_jp: Quarkus に関する厳選されたオンライン記事、およびビデオが、Quarkus ニュースレターの2026年1月号でご覧いただけます。

source: Curated online stories, articles, and videos about Quarkus are available in the March 2026 edition of the Quarkus Newsletter.
ja_jp: Quarkus ニュースレター2026年3月号では、Quarkusに関する厳選されたオンライン記事、ブログ、ビデオをご覧いただけます。

source: Current Context
ja_jp: カレントコンテキスト

source: Current Run Modes
ja_jp: 現在の実行モード

source: Current limitations
ja_jp: 現在の制限事項

source: Current request thread name
ja_jp: 現在のリクエストスレッド名

source: Currently `@QuarkusTest` and `@QuarkusIntegrationTest` should not be run in the same test run.
ja_jp: 現在、 `@QuarkusTest` と `@QuarkusIntegrationTest` を同じテストランで実行しないでください。

source: Currently the following UI component are available:
ja_jp: 現在、以下の UI コンポーネントが利用可能です。

source: Currently the following modes are supported:
ja_jp: 現在、以下のモードがサポートされています:

source: Currently you cannot use the `@SecureField` annotation to secure your data returned from resource methods returning the `io.smallrye.mutiny.Multi` reactive type.
ja_jp: 現在、 `io.smallrye.mutiny.Multi` リアクティブ型を返すリソースメソッドから返されるデータを保護するために `@SecureField` アノテーションを使用できません。

source: Currently, Auth0 does not support the standard OIDC RP-initiated logout and does not provide an end session endpoint URL in its discoverable metadata, but it provides its own logout mechanism which works nearly exactly the same as the standard one.
ja_jp: 現在、Auth0 は標準の OIDC RP-initiated Logoutをサポートしておらず、検出可能なメタデータにセッション終了エンドポイント URL を提供していませんが、標準のものとほぼ同じように動作する独自のログアウトメカニズムを提供しています。

source: Currently, Funqy can only consume JSON-based data. It supports both Binary and Structured mode of execution, but the data component of the Cloud Event message must be JSON. This JSON must also be marshallable to and from the Java parameters and return types of your functions.
ja_jp: 現在、FunqyはJSONベースのデータしか消費できません。それ自体はバイナリモードと構造化モードの両方をサポートしていますが、Cloud EventメッセージのデータコンポーネントはJSONでなければなりません。このJSONは、関数のJavaパラメータやリターンタイプとの間でマーシャル可能でなければなりません。

source: Currently, Quarkus `quarkus-oidc-client-registration` extension has an `experimental` status. Dynamic client registration API provided by this extension may change while this extension has an experiemental status.
ja_jp: 現在、Quarkus の `quarkus-oidc-client-registration` エクステンションは `experimental` ステータスです。 このエクステンションが experimental ステータスである間、このエクステンションによって提供される動的クライアント登録 API は変更される可能性があります。

source: Currently, Quarkus doesn't support link:https://docs.mongodb.com/manual/core/security-client-side-encryption/[Client-Side Field Level Encryption] in native mode.
ja_jp: 現在、Quarkusはネイティブモードでの link:https://docs.mongodb.com/manual/core/security-client-side-encryption/[Client-Side Field Level Encryption]をサポートしていません。

source: Currently, `io.quarkus.oidc.client.spi.TokenProvider` is only available for default OIDC clients, since custom extensions are unlikely to be aware of multiple named OIDC clients.
ja_jp: 現在、カスタムエクステンションが複数の名前付き OIDC クライアントを認識する可能性は低いため、 `io.quarkus.oidc.client.spi.TokenProvider` はデフォルトの OIDC クライアントでのみ使用できます。

source: Currently, are available the following exporters (may be outdated) for:
ja_jp: 現在、次のエクスポーターが利用可能です (古い可能性があります)。

source: Currently, assistant functions are available in:
ja_jp: 現在、アシスタント機能は以下で利用可能です:

source: Currently, expressions do not support parentheses for logical operators and are evaluated from left to right
ja_jp: 現在、式は論理演算子の括弧をサポートしておらず、左から右に評価されます。

source: Currently, generic interface methods using type variables or wildcards cannot be secured reliably with standard security annotations. Therefore, you must not attempt to secure such methods and instead use two alternatives described below.
ja_jp: 現在、型変数やワイルドカードを使用する汎用インターフェースメソッドは、標準のセキュリティーアノテーションでは確実には保護できません。したがって、そのようなメソッドを保護しようとするのではなく、以下に説明する 2 つの代替案のいずれかを使用する必要があります。

source: Currently, introspection credentials, if configured, can only be sent as HTTP POST form parameters.
ja_jp: 現在のところ、イントロスペクションクレデンシャルが設定されている場合、それらは HTTP POST フォームパラメーターとしてのみ送信できます。

source: Currently, only the default backend for Hibernate Search Elasticsearch is supported, because Dev Services for Elasticsearch can only start one Elasticsearch container.
ja_jp: 現在、Dev Services for Elasticsearchは1つのElasticsearchコンテナしか起動できないため、Hibernate Search Elasticsearchのデフォルトバックエンドのみがサポートされています。

source: Currently, only the integration with Hibernate ORM is supported. Other variants of the Panache API, such as MongoDB and Hibernate Reactive, are not supported yet.
ja_jp: 現在、Hibernate ORM との統合のみがサポートされています。MongoDB や Hibernate Reactive など、Panache API のその他のバリアントはまだサポートされていません。

source: Currently, the `Credentials Provider` interface is implemented by the `vault` extension, and is supported by the following credentials consumer extensions:
ja_jp: 現在、 `Credentials Provider` インターフェイスは `vault` エクステンションによって実装されており、以下のクレデンシャルコンシューマーエクステンションによってサポートされています。

source: Currently, the client supports the following parameter keys (case-insensitive):
ja_jp: 現在、クライアントは以下のパラメーターキーをサポートしています (大文字と小文字を区別します)。

source: Currently, the client supports the following parameter keys:
ja_jp: 現在、クライアントは以下のパラメーターキーをサポートしています。

source: Currently, the client supports:
ja_jp: 現在、クライアントは以下をサポートしています:

source: Currently, the following Quarkus extensions support this feature:
ja_jp: 現在、以下のQuarkusエクステンションがこの機能をサポートしています。

source: Currently, the following messaging extensions support configuration through the Quarkus TLS Registry:
ja_jp: 現在、次のメッセージングエクステンションは、Quarkus TLS レジストリーを介した設定をサポートしています。

source: Currently, there is a bug in Gradle JaCoCo which requires the `excludes` to be specified in this manner - https://github.com/gradle/gradle/issues/14760. Once this issue is fixed, excludes
ja_jp: 現在、GradleのJaCoCoには、 `excludes` をこのように指定する必要があります。 - https://github.com/gradle/gradle/issues/14760 の問題が修正されると、除外されます

source: Currently, this extension supports Hibernate ORM and MongoDB with Panache and can generate CRUD resources that work with `application/json` and `application/hal+json` content and generates REST Resources backed by Quarkus REST.
ja_jp: このエクステンションは現在、Hibernate ORM と MongoDB with Panache をサポートしており、 `application/json` および `application/hal+json` コンテンツで動作する CRUD リソースを生成し、Quarkus REST に支えられた REST リソースを生成できます。

source: Currently, this extension supports Hibernate ORM and MongoDB with Panache and can generate CRUD resources that work with `application/json` and `application/hal+json` content.
ja_jp: 現在、このエクステンションは Hibernate ORM と MongoDB with Panache をサポートしており、 `application/json` と `application/hal+json` のコンテンツで動作する CRUD リソースを生成できます。

source: Currently, this feature is used by the following extensions:
ja_jp: 現在、この機能は以下のエクステンションで使用されています：

source: Currently, this feature is used by the following extensions: - xref:flyway.adoc[Flyway] - xref:liquibase.adoc[Liquibase] - xref:liquibase-mongodb.adoc[Liquibase MongoDB]
ja_jp: 現在、この機能は以下のエクステンションで使われています： - xref:flyway.adoc[Flyway] - xref:liquibase.adoc[Liquibase] - xref:liquibase-mongodb.adoc[Liquibase MongoDB]

source: Custom Annotations
ja_jp: カスタムアノテーション

source: Custom Channel building
ja_jp: カスタムチャンネルの構築

source: Custom Credentials Provider
ja_jp: カスタムクレデンシャルプロバイダー

source: Custom Entrypoint
ja_jp: カスタムエントリーポイント

source: Custom Factories
ja_jp: カスタムファクトリー

source: Custom HttpSecurityPolicy
ja_jp: カスタムの HttpSecurityPolicy

source: Custom IDs
ja_jp: カスタムID

source: Custom JAX-RS SecurityContext
ja_jp: カスタム JAX-RS SecurityContext

source: Custom Jakarta REST SecurityContext
ja_jp: カスタムJakarta REST SecurityContext

source: Custom Lambda
ja_jp: カスタム Lambda

source: Custom Locator Example
ja_jp: カスタムロケーターの例

source: Custom Mocks For Unsatisfied Dependencies
ja_jp: 満たされていない依存関係のカスタムモック

source: Custom Profiles
ja_jp: カスタムプロファイル

source: Custom Security Integration
ja_jp: カスタムセキュリティーの統合

source: Custom Targets
ja_jp: カスタムターゲット

source: Custom Token Verificition
ja_jp: カスタムトークン検証

source: Custom URL query parameters are restored after the redirect but after the tenant configuration is resolved
ja_jp: カスタム URL クエリーパラメーターは、リダイレクト後、テナント設定が解決された後に復元されます。

source: Custom Wizard
ja_jp: カスタムウィザード

source: Custom `ConfigSource`
ja_jp: カスタム `ConfigSource`

source: Custom `Converter`
ja_jp: カスタム `Converter`

source: Custom `OidcRedirectFilter` for local error and session expired pages can also create secure cookies to help with generating such pages.
ja_jp: ローカルエラーおよびセッション期限切れページ用のカスタム `OidcRedirectFilter` により、そのようなページの生成に役立つセキュアな Cookie を作成することもできます。

source: Custom `TenantResolver` and `TenantConfigResolver` implementations may return `null` if no tenant can be inferred from the current request and a fallback to the default tenant configuration is required.
ja_jp: カスタムの `TenantResolver` および `TenantConfigResolver` の実装では、現在のリクエストからテナントを推測できず、デフォルトのテナント設定へのフォールバックが必要な場合は `null` を返すことがあります。

source: Custom `TenantResolver` and `TenantConfigResolver` implementations might return `null` if no tenant can be inferred from the current request and a fallback to the default tenant configuration is required.
ja_jp: 現在のリクエストからテナントを推測できず、デフォルトのテナント設定へのフォールバックが必要な場合、カスタム `TenantResolver` および `TenantConfigResolver` 実装は、`null` を返すことがあります。

source: Custom `bootstrap` script
ja_jp: カスタム `bootstrap` スクリプト

source: Custom `quarkus.oidc.TokenCustomizer` can be used in advanced cases requiring JWT token header pre-processing for the token signature verification to succeed.
ja_jp: カスタムの `quarkus.oidc.TokenCustomizer` は、トークンの署名検証を成功させるために JWT トークンヘッダーの事前処理が必要な高度なケースで使用できます。

source: Custom annotations can be added in a way similar to labels.For example to add the annotation `foo=bar` and `app.quarkus/id=42` just apply the following configuration:
ja_jp: 例えば、アノテーション `foo=bar` と `app.quarkus/id=42` を追加するには、次の設定を適用するだけです。

source: Custom authentication
ja_jp: カスタム認証

source: Custom cards
ja_jp: カスタムカード

source: Custom codec
ja_jp: カスタムコーデック

source: Custom config mapping using service labels
ja_jp: サービスラベルを使用したカスタム設定マッピング

source: Custom dashboards
ja_jp: カスタムダッシュボード

source: Custom databases and drivers
ja_jp: カスタムデータベースとドライバー

source: Custom exception handling
ja_jp: カスタム例外処理

source: Custom extensions
ja_jp: カスタムエクステンション

source: Custom extensions that contain JAX-RS Resources, Providers or REST Client interfaces in their runtime modules and depend on Jandex indexing for their discovery (for example because they have an empty `META-INF/beans.xml` file) don't have to perform any additional setup to make these discoverable by RESTEasy Reactive.
ja_jp: JAX-RSリソース、プロバイダ、RESTクライアントインターフェースを実行時モジュールに含み、その発見をJandexインデックスに依存するカスタムエクステンション（例えば、空の `META-INF/beans.xml` ファイルを持っているから）は、RESTEasy Reactiveでこれらを発見可能にするための追加設定を行う必要がありません。

source: Custom extensions that contain Jakarta REST Resources, Providers or REST Client interfaces in their runtime modules and depend on Jandex indexing for their discovery (for example because they have an empty `META-INF/beans.xml` file) don't have to perform any additional setup to make these discoverable by Quarkus REST.
ja_jp: Jakarta REST Resources、Providers、REST Clientインターフェースを実行時モジュールに含み、 Jandexインデックスに依存するカスタムエクステンションは（たとえば、空の `META-INF/beans.xml` ファイルを持つため）、 Quarkus REST でこれらを検出できるように、追加で設定を行う必要はありません。

source: Custom extensions that contain Jakarta REST Resources, Providers or REST Client interfaces in their runtime modules and depend on Jandex indexing for their discovery (for example because they have an empty `META-INF/beans.xml` file) don't have to perform any additional setup to make these discoverable by RESTEasy Reactive.
ja_jp: Jakarta REST Resources、Providers、REST Clientインターフェースを実行時モジュールに含み、Jandexインデックスに依存するカスタムエクステンションは（例えば、空の `META-INF/beans.xml` ファイルを持つため）、RESTEasy Reactiveでこれらを検出できるようにするための追加設定を行う必要はありません。

source: Custom factories
ja_jp: カスタムファクトリー

source: Custom functions, types and mappings
ja_jp: カスタム関数、型、およびマッピング

source: Custom headers support
ja_jp: カスタムヘッダーのサポート

source: Custom policy name must match the value returned by the `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy.name` method.
ja_jp: カスタムポリシー名は、 `io.quarkus.vertx.http.runtime.security.HttpSecurityPolicy.name` メソッドによって返される値とマッチする必要があります。

source: Custom requirements
ja_jp: カスタム要件

source: Custom scopes and contexts
ja_jp: カスタムスコープとコンテキスト

source: Custom serialization
ja_jp: カスタムシリアライゼーション

source: Custom server building
ja_jp: カスタムサーバーの構築

source: Custom test configuration profile in JVM mode
ja_jp: JVMモードでのカスタムテスト設定プロファイル

source: Custom test resource
ja_jp: カスタムテストリソース

source: Custom token verification
ja_jp: カスタムトークン検証

source: Customise Propagator
ja_jp: プロパゲーターをカスタマイズする

source: Customizable client load-balancing strategies
ja_jp: カスタマイズ可能なクライアントロードバランシング戦略

source: Customization
ja_jp: カスタマイズ

source: Customization and other useful tips
ja_jp: カスタマイズやその他の便利なヒント

source: Customize Quarkus' security layer behavior.
ja_jp: Quarkusのセキュリティレイヤーの動作をカスタマイズ。

source: Customize authentication error response
ja_jp: 認証エラー応答をカスタマイズする

source: Customize authentication exception responses
ja_jp: 認証例外応答のカスタマイズ

source: Customize authentication requests
ja_jp: 認証要求をカスタマイズする

source: Customize how Consul polls service health:
ja_jp: Consul がサービスのヘルス状態をポーリングする方法をカスタマイズします。

source: Customize the JAXB configuration
ja_jp: JAXB 設定をカスタマイズする

source: Customize the Mongo client configuration programmatically
ja_jp: Mongo クライアント設定のプログラムによるカスタマイズ

source: Customize the Redis options programmatically
ja_jp: プログラムによる Redis オプションのカスタマイズ

source: Customize the Vert.x configuration
ja_jp: Vert.x設定のカスタマイズ

source: Customize the log format to use `%X\{mdc-key\}`.
ja_jp: `%X{mdc-key}` を使用するようにログフォーマットをカスタマイズします。

source: Customized Template Path
ja_jp: カスタマイズされたテンプレート・パス

source: Customized Template Path Example
ja_jp: カスタマイズされたTemplate Pathの例

source: Customizer name
ja_jp: カスタマイザー名

source: Customizing
ja_jp: カスタマイズ

source: Customizing Automatic Service Binding
ja_jp: 自動サービスバインディングのカスタマイズ

source: Customizing Flyway
ja_jp: Flywayのカスタマイズ

source: Customizing JSON handling from an extension
ja_jp: エクステンションからJSON処理をカスタマイズする

source: Customizing JSON-B
ja_jp: JSON-B のカスタマイズ

source: Customizing JSON/XML serialization/deserialization
ja_jp: JSON/XML シリアル化/デシリアル化のカスタマイズ

source: Customizing Jackson
ja_jp: KJackson のカスタマイズ
